Revit 2027 API
RectangleLightShape Constructor
Overload List
Name | Description
RectangleLightShape() |  Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
RectangleLightShape(RectangleLightShape) |  Creates a copy of the given rectangle light shape
RectangleLightShape(Double, Double) |  Creates a rectangle light shape object with the given emit length and width.
Top
See Also
Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace